# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np
import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents.

In [2]:
# Your code here:
salaries = pd.read_csv('Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [3]:
# Your code here:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [4]:
# Your code here:

salaries.isna().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25161
Annual Salary         8022
Hourly Rate          25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [5]:
# Your code here:

salaries['Salary or Hourly'].value_counts()

Salary    25161
Hourly     8022
Name: Salary or Hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [6]:
# Your code here:

salaries['Department'].value_counts()

POLICE                   13414
FIRE                      4641
STREETS & SAN             2198
OEMC                      2102
WATER MGMNT               1879
AVIATION                  1629
TRANSPORTN                1140
PUBLIC LIBRARY            1015
GENERAL SERVICES           980
FAMILY & SUPPORT           615
FINANCE                    560
HEALTH                     488
CITY COUNCIL               411
LAW                        407
BUILDINGS                  269
COMMUNITY DEVELOPMENT      207
BUSINESS AFFAIRS           171
COPA                       116
BOARD OF ELECTION          107
DoIT                        99
PROCUREMENT                 92
INSPECTOR GEN               87
MAYOR'S OFFICE              85
CITY CLERK                  84
ANIMAL CONTRL               81
HUMAN RESOURCES             79
CULTURAL AFFAIRS            65
BUDGET & MGMT               46
ADMIN HEARNG                39
DISABILITIES                28
TREASURER                   22
HUMAN RELATIONS             16
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: Department, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [7]:
# Your code here:

import scipy.stats as st

C:\Users\giusa\anaconda3\lib\site-packages\scipy\__init__.py:146: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.23.4
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [8]:
# Your code here:

hourly = salaries[['Hourly Rate']]
hourly

       Hourly Rate
0              NaN
1              NaN
2              NaN
3              NaN
4            19.86
...            ...
33178          NaN
33179          NaN
33180          NaN
33181          NaN
33182          NaN

[33183 rows x 1 columns]

In [9]:
hourly.dropna(inplace=True)

C:\Users\giusa\AppData\Local\Temp\ipykernel_16952\1580475742.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hourly.dropna(inplace=True)

In [10]:
hourly.value_counts()

Hourly Rate
35.60          1415
40.20           781
36.21           626
19.86           418
46.10           306
               ...
35.43             1
46.75             1
34.66             1
15.38             1
109.00            1
Length: 167, dtype: int64

In [11]:
sample = hourly['Hourly Rate'].sample(8022)

st.ttest_1samp(sample, 30.00)

Ttest_1sampResult(statistic=20.619805785494147, pvalue=4.3230240486274225e-92)

In [12]:
# from the p-value we can assume that the value is not significantly different from $30/hr.

In [13]:
hourly['Hourly Rate'].mean()

32.78855771628128

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

Using the `crosstab` function, find the department that has the most hourly workers.

In [14]:
police = salaries[['Department', 'Annual Salary']]

In [15]:
police= police.dropna()

In [16]:
police = police[police['Department'] == 'POLICE']
police

      Department  Annual Salary
0         POLICE       101442.0
1         POLICE        94122.0
9         POLICE        93354.0
11        POLICE        84054.0
12        POLICE        87006.0
...          ...            ...
33177     POLICE        72510.0
33178     POLICE        72510.0
33179     POLICE        48078.0
33180     POLICE        90024.0
33181     POLICE        93354.0

[13404 rows x 2 columns]

In [17]:
sample2 = police['Annual Salary'].sample(13404)

s_mean = sample2.mean() 
std = sample2.std(ddof = 1)

In [18]:

test = st.ttest_1samp(sample2, 86000)
test

Ttest_1sampResult(statistic=3.081997005712994, pvalue=0.0020603403550965137)

In [19]:
# The hypothesis that the salaries are equal to 86k is not correct, given the statistic value we can assume that its higher

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [20]:

hourly_max = salaries[['Hourly Rate', 'Department']]
hourly_max

       Hourly Rate        Department
0              NaN            POLICE
1              NaN            POLICE
2              NaN  GENERAL SERVICES
3              NaN       WATER MGMNT
4            19.86              OEMC
...            ...               ...
33178          NaN            POLICE
33179          NaN            POLICE
33180          NaN            POLICE
33181          NaN            POLICE
33182          NaN              DoIT

[33183 rows x 2 columns]

In [21]:
hourly_max = hourly_max.dropna()

In [22]:
hourly_max = salaries[['Hourly Rate', 'Department']]
hourly_max

       Hourly Rate        Department
0              NaN            POLICE
1              NaN            POLICE
2              NaN  GENERAL SERVICES
3              NaN       WATER MGMNT
4            19.86              OEMC
...            ...               ...
33178          NaN            POLICE
33179          NaN            POLICE
33180          NaN            POLICE
33181          NaN            POLICE
33182          NaN              DoIT

[33183 rows x 2 columns]

In [23]:
# Streets & San Department has the most hourly workers.

hourly_max.value_counts()

Hourly Rate  Department
36.21        STREETS & SAN    626
35.60        STREETS & SAN    607
             AVIATION         462
40.20        WATER MGMNT      451
19.86        OEMC             418
                             ...
36.18        WATER MGMNT        1
35.43        WATER MGMNT        1
34.66        TRANSPORTN         1
32.59        STREETS & SAN      1
109.00       HEALTH             1
Length: 277, dtype: int64

In [24]:
streets = salaries[['Department', 'Hourly Rate']]

In [25]:
streets = streets.dropna()

In [26]:
streets = streets[streets['Department'] == 'STREETS & SAN']
streets

          Department  Hourly Rate
7      STREETS & SAN        35.60
21     STREETS & SAN        21.43
24     STREETS & SAN        35.60
36     STREETS & SAN        36.21
39     STREETS & SAN        35.60
...              ...          ...
33106  STREETS & SAN        36.13
33107  STREETS & SAN        35.60
33147  STREETS & SAN        35.60
33149  STREETS & SAN        36.21
33156  STREETS & SAN        22.12

[1862 rows x 2 columns]

In [27]:
sample3 = streets['Hourly Rate'].sample(1862)

s_mean = sample3.mean() 
std = sample3.std(ddof = 1)

In [28]:
test = st.ttest_1samp(sample3, 35)
test

Ttest_1sampResult(statistic=-9.567447887848152, pvalue=3.3378530564707717e-21)

In [29]:
# The hypothesis that the salaries are equal to 35/h  is not correct, given the negative statistic value we can assume that the workers are right.

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [35]:
# Your code here:
hourly = salaries.loc[(salaries['Hourly Rate'].isnull() == False), 'Hourly Rate']
sample_mean = np.mean(hourly)
sample_error = st.sem(hourly)
st.t.interval(.95, loc=sample_mean, scale=sample_error, df= len(hourly)-1)

(32.52345834488529, 33.05365708767727)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [36]:
# Your code here:
annual = salaries.loc[(salaries['Hourly Rate'].isnull() == True), 'Annual Salary']
sample_mean = np.mean(annual)
sample_error = st.sem(annual)
st.t.interval(.95, loc=sample_mean, scale=sample_error, df= len(annual)-1)

(86526.99656774197, 87047.0030125611)

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [32]:
# Your code here: